hit-iz-web/src/main/webapp/resources/connectivity/send.json

{
    "outgoing": "<env:Envelope xmlns:env=\"http://www.w3.org/2003/05/soap-envelope\"><env:Header/><env:Body><ns2:submitSingleMessage xmlns:ns2=\"urn:cdc:iisb:2011\"><username>user-name</username><password>pass-word</password><facilityID>facility-id</facilityID><hl7Message>sent hl7 message</hl7Message></ns2:submitSingleMessage></env:Body></env:Envelope>",
    "incoming": "<env:Envelope xmlns:env=\"http://www.w3.org/2003/05/soap-envelope\"><env:Header/><env:Body><ns2:connectivityTestResponse xmlns:ns2=\"urn:cdc:iisb:2011\"><ns2:return>Hello world</ns2:return></ns2:connectivityTestResponse></env:Body></env:Envelope>"
}